In [3]:
import pandas as pd

In [4]:
df1 = pd.DataFrame({'employee':['Gary', 'Stu', 'Mary', 'Sue'], 'group':['Accounting', 'Marketing', 'Marketing', 'HR']})
df1

  employee       group
0     Gary  Accounting
1      Stu   Marketing
2     Mary   Marketing
3      Sue          HR

In [5]:
df2 = pd.DataFrame({'employee': ['Mary', 'Stu', 'Gary', 'Sue'], 'hire_date': [2008, 2012, 2017, 2018]})
df2

  employee  hire_date
0     Mary       2008
1      Stu       2012
2     Gary       2017
3      Sue       2018

In [6]:
df_combined = pd.merge(df1, df2)
df_combined

  employee       group  hire_date
0     Gary  Accounting       2017
1      Stu   Marketing       2012
2     Mary   Marketing       2008
3      Sue          HR       2018

In [7]:
df3 = pd.DataFrame({'group':['Accounting', 'Marketing', 'HR'], 'supervisor': ['Carlos', 'Giada', 'Stephanie']})
df3

        group supervisor
0  Accounting     Carlos
1   Marketing      Giada
2          HR  Stephanie

In [8]:
pd.merge(df_combined, df3)

  employee       group  hire_date supervisor
0     Gary  Accounting       2017     Carlos
1      Stu   Marketing       2012      Giada
2     Mary   Marketing       2008      Giada
3      Sue          HR       2018  Stephanie

In [9]:
pd.merge(df_combined, df3, on='group')

  employee       group  hire_date supervisor
0     Gary  Accounting       2017     Carlos
1      Stu   Marketing       2012      Giada
2     Mary   Marketing       2008      Giada
3      Sue          HR       2018  Stephanie

In [ ]:
df4 = pd.DataFrame({'group':['Accounting', 'Accounting', 'Marketing', 'Marketing', 'HR', 'HR'], 'core_skills': ['math', 'spreadsheets', 'writing', 'communication', 'spreadsheets', 'organization']})